# Consultas em SQL

### Tema: Gerenciador de peladas
#### Grupo:
* Breno Poggiali de Sousa
* Gabriela Peres Neme
* Guilherme de Abreu Lima Buitrago Miranda
* Vinicius Julião Ramos 

#### Objetivo:
Esse notebook abarca parte do trabalho prático que solicita a criação de 10 consutlas SQL, contendo descrição textual, comando SQL e resultado.

Tais consultas devem atender aos requisitos mínimos:
* 2 operações de seleção e projeção
* 3 junção de duas relações
* 3 junção de três ou mais relações
* 2 funções de agregação sobre o resultado da junção de pelo menos duas relações

Ademais, o presente Notebook incluirá o item iii das Características avançadas, que especifica:
* iii. mais três consultas do tipo relatório

#### Importação das bibliotecas:

In [1]:
import io
import sqlite3
import pandas as pd

#### Conexão com o banco de dados:

In [2]:
conn = sqlite3.connect('../instance/backend.sqlite')
cursor = conn.cursor()

#### Carga dos dados:
Código comentado pois deve ser executado uma única vez, e já o foi.

In [3]:
#f = io.open('BD/criacao_tabelas.sql', 'r', encoding = 'utf-8')
#sql = f.read()
#cursor.executescript(sql)

#f = io.open('BD/popula_tabelas.sql', 'r', encoding = 'utf-8')
#sql = f.read()
#cursor.executescript(sql)

## 10 consultas SQL

#### Consulta 1
Lista, para uma vaquinha coletiva específica, todas as pessoas que estão participando e o valor já pago por cada um dos participantes.

In [3]:
id_vaquinha_coletiva = 2

df01 = pd.read_sql_query("SELECT nome_pessoa, valor_pago " +
                         "FROM Vaquinha_Coletiva_Pessoa NATURAL JOIN Pessoa " +
                         "WHERE id_vaquinha_coletiva = " + str(id_vaquinha_coletiva) + " "
                         "ORDER BY nome_pessoa;", conn)

df01

         nome_pessoa  valor_pago
0            Cazares        20.0
1               Dedé        20.0
2              Fábio        20.0
3       Fábio Santos        20.0
4           Henrique        20.0
5   Leandro Donizete        20.0
6     Leonardo Silva         1.0
7                Léo        20.0
8              Otero        20.0
9              Réver        20.0
10      Thiago Neves         1.0
11            Victor        20.0

#### Consulta 2
Lista as métricas de todos os jogadores que participaram de uma determinada partida, ordenando alfabeticamente.

In [53]:
id_pelada = 2300

df02 = pd.read_sql_query("SELECT nome_pessoa, Pontos, Pontos, G, FF, FD, DD, SG, GS " +
                         "FROM Jogador NATURAL JOIN Pessoa " +
                         "WHERE Jogador.id_pelada = " + str(id_pelada) + " " +
                         "ORDER BY Pontos DESC;", conn)

        
df02

        nome_pessoa  Pontos  Pontos  G  FF  FD  DD  SG  GS
0      Paulo Victor     7.0     7.0  0   0   0   3   0   1
1        Alecsandro     3.7     3.7  0   2   1   0   0   0
2         Léo Moura     3.1     3.1  0   0   0   0   0   0
3           Arthur      3.1     3.1  0   0   0   0   0   0
4           Everton     2.4     2.4  0   3   0   0   0   0
5          Canteros     2.2     2.2  0   0   0   0   0   0
6     Márcio Araújo     1.8     1.8  0   1   0   0   0   0
7           Wallace     1.7     1.7  0   0   1   0   0   0
8  Eduardo Da Silva     0.9     0.9  0   0   2   0   0   0
9           Gabriel     0.2     0.2  0   0   1   0   0   0

#### Consulta 4
Lista todas as peladas de um grupo que estão compreendidas em um determinado intervalo de tempo

In [12]:
id_grupo_de_pelada = 282 #grupo desejado
data_inicio = '2018-06-04 00:00:00' #formato AAAA-MM-DD HH:MM:SS
data_fim = '2018-06-30 00:00:00' #formato AAAA-MM-DD HH:MM:SS

df04 = pd.read_sql_query("SELECT lugar, preco, inicio, fim " +
                         "FROM Grupo_de_pelada NATURAL JOIN Pelada " +
                         "WHERE id_grupo_de_pelada = " + str(id_grupo_de_pelada) + " AND " +
                             "(inicio BETWEEN '"+ data_inicio +"' AND '" + data_fim + "' ) " +
                         "ORDER BY inicio;", conn)

        
df04

,lugar,preco,inicio,fim
0,Campo do Atlético - MG,4.5,2018-06-26 22:34:18.434397,2018-06-26 23:34:18.434402
1,Campo do Atlético - MG,4.5,2018-06-26 22:34:18.434397,2018-06-26 23:34:18.434402
2,Campo do Atlético - MG,4.5,2018-06-27 22:34:18.434397,2018-06-27 23:34:18.434402
3,Campo do Atlético - MG,4.5,2018-06-28 22:34:18.434397,2018-06-28 23:34:18.434402
4,Campo do Atlético - MG,4.5,2018-06-29 22:34:18.434397,2018-06-29 23:34:18.434402

#### Consulta 5
Lista todas vaquinhas de um grupo que estão compreendidas em um determinado intervalo de tempo

In [18]:
id_grupo_de_pelada = 262 #grupo desejado
data_inicio = '2019-08-10 00:00:00' #formato AAAA-MM-DD HH:MM:SS
data_fim = '2019-08-30 00:00:00' #formato AAAA-MM-DD HH:MM:SS

df05 = pd.read_sql_query("SELECT motivo, prazo " +
                         "FROM Grupo_de_pelada NATURAL JOIN Vaquinha " +
                         "WHERE id_grupo_de_pelada = " + str(id_grupo_de_pelada) + " AND " +
                             "(prazo BETWEEN '"+ data_inicio +"' AND '" + data_fim + "' ) " +
                         "ORDER BY prazo LIMIT 2;", conn)

        
df05

   motivo                prazo
0  camisa  2019-08-11 00:00:00
1  camisa  2019-08-11 00:00:00

#### Consulta 6
Lista todos os grupos de pelada a que uma pessoa pertence.

In [22]:
#pessoa desejada
email = 'réver52253@pelada.com'

df06 = pd.read_sql_query("SELECT Grupo_de_pelada.nome, Grupo_de_pelada.descricao " +
                         "FROM Pessoa NATURAL JOIN Participa_grupo_pelada NATURAL JOIN Grupo_de_pelada " +
                         "WHERE Pessoa.email = '" + email + "';", conn)

        
df06

                 nome                                          descricao
0       Atlético - MG       Grupo de pelada dos atletas do Atlético - MG
1  Internacional - RS  Grupo de pelada dos atletas do Internacional - RS
2       Flamengo - RJ       Grupo de pelada dos atletas do Flamengo - RJ

#### Consulta 7
Lista as últimas partidas que o jogador participou, o grupo de pelada em que a partida foi jogada, a data e a hora da partida, e as métricas do jogador na partida em questão, mostrando a mais recentes primeiro. 

Obs: Os dados em questão são fictícios. Por isso exitem resultados com datas futuras. No entanto, uma linha na tabela Jogador só será criada após a partida. Assim, apenas serão retornados valores de jogos que já ocorreram (e não que vão ocorrer, como aconteceu no exemplo abaixo).

In [56]:
#pessoa desejada
email = 'marcosrocha63013@pelada.com'

df07 = pd.read_sql_query("SELECT Grupo_de_pelada.nome, Pelada.lugar, Pelada.preco, Pelada.inicio, Pontos, G, RB, A, SG " +
                         "FROM Pessoa NATURAL JOIN Jogador NATURAL JOIN Pelada NATURAL JOIN Grupo_de_pelada " +
                         "WHERE Pessoa.email = '" + email + "'"+
                         "ORDER BY inicio desc LIMIT 10;", conn)

        
df07

,nome,lugar,preco,inicio,Pontos,G,RB,A,SG
0,Atlético - MG,Campo do Atlético - MG,4.5,2018-11-23 22:34:18.434397,13.3,0,5,0,1
1,Atlético - MG,Campo do Atlético - MG,4.5,2018-11-22 22:34:18.434397,5.5,0,3,0,0
2,Atlético - MG,Campo do Atlético - MG,4.5,2018-11-21 22:34:18.434397,3.0,0,3,0,0
3,Atlético - MG,Campo do Atlético - MG,4.5,2018-11-19 22:34:18.434397,8.0,0,3,1,0
4,Atlético - MG,Campo do Atlético - MG,4.5,2018-11-16 22:34:18.434397,10.7,0,4,0,1
5,Atlético - MG,Campo do Atlético - MG,4.5,2018-11-14 22:34:18.434397,3.9,0,3,0,0
6,Atlético - MG,Campo do Atlético - MG,4.5,2018-11-13 22:34:18.434397,10.3,0,6,0,0
7,Atlético - MG,Campo do Atlético - MG,4.5,2018-11-12 22:34:18.434397,8.3,0,3,0,1
8,Atlético - MG,Campo do Atlético - MG,4.5,2018-11-11 22:34:18.434397,5.8,0,4,0,0
9,Atlético - MG,Campo do Atlético - MG,4.5,2018-11-10 22:34:18.434397,8.4,0,4,1,0

#### Consulta 8
Obtém todas as pessoas parcitipantes de uma vaquinha individual e a coluna de personalização (resposta) correspondente.

In [30]:
id_vaquinha_individual = 1

df08 = pd.read_sql_query("SELECT pergunta_personalizada, valor, resposta " +
                         "FROM Pessoa NATURAL JOIN Vaquinha_Individual_Pessoa NATURAL JOIN Vaquinha_Individual " +
                         "WHERE id_vaquinha_individual = " + str(id_vaquinha_individual) + " " +
                         "ORDER BY nome_pessoa;", conn)

df08

   pergunta_personalizada  valor          resposta
0          Nome na camisa   25.0      Ariel Cabral
1          Nome na camisa   25.0             Borja
2          Nome na camisa   25.0           Cazares
3          Nome na camisa   25.0             Conca
4          Nome na camisa   25.0             Cueva
5          Nome na camisa   25.0              Dedé
6          Nome na camisa   25.0       Felipe Melo
7          Nome na camisa   25.0             Fábio
8          Nome na camisa   25.0      Fábio Santos
9          Nome na camisa   25.0          Henrique
10         Nome na camisa   25.0          Hernanes
11         Nome na camisa   25.0         Keirrison
12         Nome na camisa   25.0  Leandro Donizete
13         Nome na camisa   25.0         Léo Silva
14         Nome na camisa   25.0      Lucas Romero
15         Nome na camisa   25.0               Léo
16         Nome na camisa   25.0             Otero
17         Nome na camisa   25.0    Paolo Guerrero
18         Nome na camisa   25.0              Pará
19         Nome na camisa   25.0       Renê Júnior
20         Nome na camisa   25.0             Réver
21         Nome na camisa   25.0      Thiago Neves
22         Nome na camisa   25.0            Victor

#### Consulta 9
Exibe a peladas com maior número total de gols feitos na partida, dentre as  quais determinado jogador participou.

In [33]:
email = 'fred38162@pelada.com'

df09 = pd.read_sql_query("SELECT Grupo_de_Pelada.nome, lugar, inicio, sum(G) as Gols_na_partida  " +
                         "FROM Jogador NATURAL JOIN Pelada NATURAL JOIN Grupo_de_Pelada " +
                         "WHERE id_pelada in (SELECT id_pelada FROM Jogador NATURAL JOIN Pessoa WHERE email = '" + email + "') " + 
                         "GROUP BY id_pelada " +
                         "ORDER BY Gols_na_partida desc limit(1);", conn)

df09

,nome,lugar,inicio,Gols_na_partida
0,Fluminense - RJ,Campo do Fluminense - RJ,2018-09-07 22:34:18.434397,4

#### Consulta 10
Contabiliza o total já arrecadado em uma vaquinha coletiva.

In [36]:
df10 = pd.read_sql_query("SELECT motivo, prazo, sum(valor_pago) as total_pago, valor_total " +
                         "FROM (Vaquinha JOIN Vaquinha_Coletiva ON Vaquinha.id_vaquinha =  Vaquinha_Coletiva.id_vaquinha_coletiva)"+
                             " NATURAL JOIN Vaquinha_Coletiva_Pessoa " +
                          "GROUP BY id_vaquinha_coletiva LIMIT 5;", conn)

df10

          motivo                prazo  total_pago  valor_total
0      churrasco  2019-06-10 00:00:00       202.0        240.0
1  aluguel campo  2019-07-03 00:00:00        82.0        100.0
2      churrasco  2019-10-02 00:00:00       241.0        300.0
3      churrasco  2019-06-10 00:00:00       202.0        240.0
4  aluguel campo  2019-07-03 00:00:00        82.0        100.0

## Consultas do tipo relatório

#### Relatório 1
Relatório que contém todos os grupos de pelada e suas médias de gols, gols contra, faltas, roubadas de bola, etc, apurado para todas as partidas.

In [39]:
rel1 = pd.read_sql_query("SELECT nome as Nome_Grupo, count(*) as Num_Peladas, avg(P) as Media_pontos,  " +
                                 "avg(G) as Media_gols, avg(GC) as media_gols_contra " +
                         "FROM Grupo_de_Pelada NATURAL JOIN "+
                               "(SELECT id_grupo_de_pelada, id_pelada, sum(Pontos) as P, sum (G) as G, sum(GC) as GC "+
                                "FROM Pelada NATURAL JOIN Jogador "+
                                "GROUP BY id_pelada )" +
                         "GROUP BY id_grupo_de_pelada ORDER BY Media_gols DESC LIMIT 10;", conn)

rel1

,Nome_Grupo,Num_Peladas,Media_pontos,Media_gols,media_gols_contra
0,Bahia - BA,37,43.389189,1.135135,0.027027
1,Corinthians - SP,120,32.374167,1.066667,0.000000
2,Fluminense - RJ,120,23.445000,0.983333,0.016667
3,Atlético - GO,38,31.539474,0.973684,0.052632
4,Atlético - MG,117,27.604274,0.957265,0.008547
5,Flamengo - RJ,117,29.508547,0.871795,0.017094
6,Vasco da Gama - RJ,38,35.460526,0.868421,0.000000
7,Palmeiras - SP,120,24.832500,0.833333,0.008333
8,Botafogo - RJ,111,25.952252,0.792793,0.018018
9,Sport - PE,115,26.346957,0.791304,0.034783

#### Relatório 2
Relatório que contém todos os participantes de um grupo e suas médias de gols, gols contra, faltas, roubadas de bola, etc. Tal média é apurada através das partidas organizadas somente pelo grupo em questão.

In [58]:
id_grupo_de_pelada = 262

rel2 = pd.read_sql_query("SELECT nome_pessoa, avg(Pontos) as Media_Pontos, avg(G) as Media_gols, avg(GC) as Media_gols_contra " +
                         "FROM Grupo_de_Pelada NATURAL JOIN Pelada NATURAL JOIN Jogador NATURAL JOIN Pessoa "+
                         "WHERE  id_grupo_de_pelada = " + str(id_grupo_de_pelada) + " " + 
                         "GROUP BY id_pessoa " +
                         "ORDER BY Media_Pontos DESC;", conn)

rel2

         nome_pessoa  Media_Pontos  Media_gols  Media_gols_contra
0            Cuéllar      5.345455    0.000000           0.000000
1              Diego      5.218519    0.370370           0.000000
2       Paulo Victor      5.009091    0.000000           0.000000
3              Réver      4.682000    0.140000           0.000000
4     Paolo Guerrero      4.261538    0.384615           0.000000
5       Willian Arão      4.185938    0.078125           0.015625
6         Rafael Vaz      4.147059    0.058824           0.000000
7              Erazo      4.050000    0.000000           0.000000
8               Renê      4.037500    0.000000           0.000000
9   Eduardo Da Silva      4.015789    0.368421           0.000000
10             Alex       3.835714    0.000000           0.000000
11         Mancuello      3.828571    0.285714           0.000000
12              Juan      3.819048    0.000000           0.000000
13            Thiago      3.733333    0.000000           0.000000
14              Pará      3.634615    0.019231           0.019231
15           Wallace      3.632258    0.032258           0.000000
16          Rhodolfo      3.631579    0.000000           0.000000
17           Rodinei      3.588235    0.058824           0.000000
18       Diego Alves      3.515789    0.000000           0.000000
19        Léo Duarte      3.400000    0.000000           0.000000
20   Éverton Ribeiro      3.392593    0.148148           0.000000
21           Everton      3.385366    0.134146           0.000000
22     Lucas Paquetá      3.247059    0.058824           0.000000
23        Alecsandro      3.016000    0.280000           0.000000
24    Leandro Damião      2.973684    0.210526           0.000000
25         Léo Moura      2.887500    0.031250           0.000000
26     Márcio Araújo      2.833696    0.021739           0.000000
27       Fernandinho      2.779167    0.125000           0.000000
28            Trauco      2.685000    0.050000           0.000000
29      Felipe Vizeu      2.535294    0.117647           0.000000
30               Léo      2.400000    0.000000           0.000000
31     Matheus Savio      2.225000    0.000000           0.000000
32           Arthur       2.025000    0.000000           0.000000
33           Gabriel      1.770833    0.125000           0.000000
34   Vinicius Junior      1.714286    0.142857           0.000000
35          Paulinho      1.557143    0.142857           0.000000
36          Canteros      1.466667    0.074074           0.000000
37     Luiz Antonio       1.465385    0.038462           0.000000
38          Geuvânio      1.306250    0.000000           0.000000
39           Hernane      1.300000    0.000000           0.000000
40     Emerson Sheik      1.220000    0.000000           0.000000
41           Berrío       0.944444    0.111111           0.000000
42            Romulo      0.642857    0.000000           0.000000
43           Negueba      0.481818    0.000000           0.000000
44           Bressan      0.400000    0.000000           0.000000
45             César     -0.033333    0.000000           0.000000
46           Ederson     -0.600000    0.000000           0.000000
47             Conca     -0.950000    0.000000           0.000000
48           Lincoln     -1.266667    0.000000           0.000000

#### Relatório 3
Relatório que mostra a evolução da pontuação do jogador mensalmente.

In [43]:
email = 'marcelogrohe37770@pelada.com'

rel3 = pd.read_sql_query("SELECT strftime('%m/%Y', inicio) as Mes, avg(Pontos) as Media_Pontos, avg(G) as Media_gols, avg(GC) as Media_gols_contra " +
                         "FROM Jogador NATURAL JOIN Pessoa NATURAL JOIN Pelada "+
                         "WHERE  email = '" + email + "' "+
                         "GROUP BY strftime('%m/%Y', inicio) " +
                         "ORDER BY strftime('%Y', inicio), strftime('%m', inicio);", conn)

rel3

       Mes  Media_Pontos  Media_gols  Media_gols_contra
0  07/2018      6.166667         0.0                0.0
1  08/2018      3.370000         0.0                0.0
2  09/2018      5.311111         0.0                0.0
3  10/2018      3.461905         0.0                0.0
4  11/2018      3.300000         0.0                0.0